InformationRegisters/ТК_ПараметрыВосстановленияПоследовательности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ТК_ПараметрыВосстановленияПоследовательности</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КоличествоДокументовПотоке</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоОдновременныхПотоковБизнес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоОдновременныхПотоков</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Последовательность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПоследовательности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ТК_ПараметрыВосстановленияПоследовательности/Ext/ManagerModule.bsl
Функция ПолучитьКоличествоДокументовВПотоке(Последовательность)Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =	"ВЫБРАТЬ
	 |	ТК_ПараметрыВосстановленияПоследовательности.КоличествоДокументовПотоке КАК ДанныеПараметра
	 |ИЗ
	 |	РегистрСведений.ТК_ПараметрыВосстановленияПоследовательности КАК ТК_ПараметрыВосстановленияПоследовательности
	 |ГДЕ
	 |	ТК_ПараметрыВосстановленияПоследовательности.Последовательность = &Последовательность";
	Запрос.УстановитьПараметр("Последовательность",Последовательность);
	
	Рез = Запрос.Выполнить();
	Если Рез.Пустой() Тогда
		Возврат 50;
	КонецЕсли;
	
	Выборка = Рез.Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.ДанныеПараметра;
	
	
	
КонецФункции


Функция ПолучитьКоличествоОдновременныхПотоков(Последовательность,БизнесВремя)Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА &БизнесВремя
	|			ТОГДА ТК_ПараметрыВосстановленияПоследовательности.КоличествоОдновременныхПотоковБизнес
	|		ИНАЧЕ ТК_ПараметрыВосстановленияПоследовательности.КоличествоОдновременныхПотоков
	|	КОНЕЦ КАК ДанныеПараметра
	|ИЗ
	|	РегистрСведений.ТК_ПараметрыВосстановленияПоследовательности КАК ТК_ПараметрыВосстановленияПоследовательности
	|ГДЕ
	|	ТК_ПараметрыВосстановленияПоследовательности.Последовательность = &Последовательность";
	Запрос.УстановитьПараметр("Последовательность",Последовательность);
	Запрос.УстановитьПараметр("БизнесВремя",БизнесВремя);
	
	
	Рез = Запрос.Выполнить();
	Если Рез.Пустой() Тогда
		Если БизнесВремя Тогда
			Возврат  5;
		Иначе
			Возврат  15;
		КонецЕсли;
	КонецЕсли;
	
	Выборка = Рез.Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.ДанныеПараметра;
	
	
	
КонецФункции
